{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "batch_input_shape": [null, 28, 28, 3], "strides": [1, 1], "trainable": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "dtype": "float32", "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activation": "relu", "name": "conv2d_2", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "units": 128, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "units": 250, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true}}]}, "keras_version": "2.2.4"}