{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 3], "activation": "relu", "filters": 32, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "filters": 64, "trainable": true, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 128, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 250, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null}}], "name": "sequential_1"}}